# Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Примеры/Тесты:
# 6 >>>  1  4  1
# 24 >>> 4  16  4
# 60 >>> 10  40  10

S_Crene = int(input("Сколько дети сделали журавликов? S = "))

S_Crene = S_Crene // 3 
Sereg = S_Crene // 2
Petr = S_Crene // 2
Kate = (Sereg + Petr) * 2

print(f"Сережа сделал {Sereg}\nКатя сделала {Kate}\nПетя сделал {Petr}")